app/Controllers/CarritoController.php

SELECT *
FROM `productos`
WHERE `productos`.`deleted_at` IS NULL
AND `productos`.`id_producto` = '7'
---
    }

    // Verificar existencia del producto
    $producto = $this->productoModel->find($id_producto);

SELECT *
FROM `productos`
WHERE `productos`.`deleted_at` IS NULL
AND `productos`.`id_producto` = '7'
---
    }

    // Verificar stock
    $producto = $this->productoModel->find($item['id_producto']);