app/Controllers/Home.php

     public function admin_productos()
    {
        if (session()->get('rol') !== 'administrador') {
            return redirect()->to('/')->with('error','Acceso no autorizado');
        }

        $model = new \App\Models\ProductoModel();
        $data['productos'] = $model->where('deleted_at', null)->findAll();
---
SELECT *
FROM `productos`
WHERE `deleted_at` IS NULL
AND `productos`.`deleted_at` IS NULL

    public function misConsultas()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login');
        }

        $idUsuario = $session->get('id_usuario');
        $consultaModel = new \App\Models\ConsultaModel();

        $consultas = $consultaModel
            ->where('id_usuario', $idUsuario)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `consultas`
WHERE `id_usuario` = '25'
AND `consultas`.`deleted_at` IS NULL
ORDER BY `created_at` DESC