app/Models/CarritoModel.php

    public function manejarProducto(int $id_usuario, int $id_producto, int $cantidad = 1): bool
    {
        // Verificar si el producto ya está en el carrito
        $item = $this->where('id_usuario', $id_usuario)
                    ->where('id_producto', $id_producto)
                    ->where('estado', 'activo')
                    ->first();

        if ($item) {
            // Actualizar cantidad
            return $this->update($item['id_carrito'], [
                'cantidad' => $item['cantidad'] + $cantidad,
                'fecha_actualizacion' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `carritos`
WHERE `id_usuario` = 17
AND `id_producto` = 7
AND `estado` = 'activo'
 LIMIT 1
UPDATE `carritos` SET `cantidad` = 10, `fecha_actualizacion` = '2025-06-19 20:19:40'
WHERE `carritos`.`id_carrito` IN ('9')

    public function obtenerItem(int $id_carrito, int $id_usuario )
    {
        $builder = $this->where('id_carrito', $id_carrito);

        if ($id_usuario !== null) {
            $builder->where('id_usuario', $id_usuario);
        }

        return $builder->first();
---
SELECT *
FROM `carritos`
WHERE `id_carrito` = 32
AND `id_usuario` = 11
 LIMIT 1

    public function actualizarCantidad(int $id_carrito, int $cantidad): bool
    {
        return $this->update($id_carrito, [
            'cantidad' => $cantidad,
            'fecha_actualizacion' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `carritos` SET `cantidad` = 1, `fecha_actualizacion` = '2025-06-22 08:07:21'
WHERE `carritos`.`id_carrito` IN (32)

    public function obtenerProductosConDetalles(int $id_usuario): array
    {
        return $this->select('carritos.*, productos.nombre, productos.precio, productos.imagen, productos.stock, productos.descripcion')
                  ->join('productos', 'productos.id_producto = carritos.id_producto')
                  ->where('carritos.id_usuario', $id_usuario)
                  ->where('carritos.estado', 'activo')
                  ->orderBy('carritos.fecha_creacion', 'DESC')
                  ->findAll();
---
SELECT `carritos`.*, `productos`.`nombre`, `productos`.`precio`, `productos`.`imagen`, `productos`.`stock`, `productos`.`descripcion`
FROM `carritos`
JOIN `productos` ON `productos`.`id_producto` = `carritos`.`id_producto`
WHERE `carritos`.`id_usuario` = 11
AND `carritos`.`estado` = 'activo'
ORDER BY `carritos`.`fecha_creacion` DESC

   public function contarProductos(int $id_usuario): int
    {
        $builder = $this->db->table($this->table);
        $builder->selectSum('cantidad');
        $builder->where('id_usuario', $id_usuario);
        $builder->where('estado', 'activo');
        $query = $builder->get();
---
SELECT SUM(`cantidad`) AS `cantidad`
FROM `carritos`
WHERE `id_usuario` = 25
AND `estado` = 'activo'