app/Models/PedidoModel.php

    public function getPedidosConUsuario()
    {
        return $this->select('pedido.*, usuarios.nombre as nombre_usuario')
                   ->join('usuarios', 'usuarios.id_usuario = pedido.id_usuario')
                   ->orderBy('pedido.fecha_pedido', 'ASC')
                   ->findAll();
---
SELECT `pedido`.*, `usuarios`.`nombre` as `nombre_usuario`
FROM `pedido`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `pedido`.`id_usuario`
ORDER BY `pedido`.`fecha_pedido` ASC